MikroElektronika/mikrosdk_v2/targets/arm/mikroe/stm32/src/dma/implementation_2/hal_ll_dma.c
/****************************************************************************
**
** Copyright (C) ${COPYRIGHT_YEAR} MikroElektronika d.o.o.
** Contact: https://www.mikroe.com/contact
**
** This file is part of the mikroSDK package
**
** Commercial License Usage
**
** Licensees holding valid commercial NECTO compilers AI licenses may use this
** file in accordance with the commercial license agreement provided with the
** Software or, alternatively, in accordance with the terms contained in
** a written agreement between you and The MikroElektronika Company.
** For licensing terms and conditions see
** https://www.mikroe.com/legal/software-license-agreement.
** For further information use the contact form at
** https://www.mikroe.com/contact.
**
**
** GNU Lesser General Public License Usage
**
** Alternatively, this file may be used for
** non-commercial projects under the terms of the GNU Lesser
** General Public License version 3 as published by the Free Software
** Foundation: https://www.gnu.org/licenses/lgpl-3.0.html.
**
** The above copyright notice and this permission notice shall be
** included in all copies or substantial portions of the Software.
**
** THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
** EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES
** OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
** IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM,
** DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT
** OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE
** OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
**
****************************************************************************/
/*!
 * @file  hal_ll_dma.c
 * @brief DMA HAL LOW LEVEL layer implementation.
 */

#include "hal_ll_rcc.h"
#include "hal_ll_dma.h"
#include "hal_ll_gpio.h"

// ------------------------------------------------------------- PRIVATE MACROS

#if defined(STM32F1xx) || defined(STM32F3xx) || defined(STM32F0xx) || \
    defined(STM32L0xx) || defined(STM32L1xx) || defined(STM32L4xx) || \
    defined(STM32H7xx) || defined(STM32G0xx)
    #define MODULE_SUPPORTED
#else
    # error "DMA for this MCU is not supported yet."
#endif

/*!< @brief DMA interrupt definitions. */
#define HAL_LL_DMA_IT_FT ((uint32_t)(1U << 1))
#define HAL_LL_DMA_IT_HT ((uint32_t)(1U << 2))
#define HAL_LL_DMA_IT_ET ((uint32_t)(1U << 3))
#define HAL_LL_DMA_IT_CLEAR_MASK (0x0fUL)

/*!< @brief DMA SCR register masks. */
#if defined(STM32H7xx)
    #define HAL_LL_DMA_CCR_PRIORITY_VERY_HIGH_MASK (0x30000)
    #define HAL_LL_DMA_CCR_PRIORITY_HIGH_MASK (0x20000)
    #define HAL_LL_DMA_CCR_PRIORITY_MEDIUM_MASK (0x10000)
    #define HAL_LL_DMA_CCR_PRIORITY_LOW_MASK (0x00000)
    #define HAL_LL_DMA_CCR_CIRC_MASK (0x100)
    #define HAL_LL_DMA_CCR_PSIZE_BYTE_MASK (0x0000)
    #define HAL_LL_DMA_CCR_PSIZE_HALFWORD_MASK (0x0800)
    #define HAL_LL_DMA_CCR_PSIZE_WORD_MASK (0x1000)
    #define HAL_LL_DMA_MSIZE_BYTE_MASK (0x0000)
    #define HAL_LL_DMA_MSIZE_HALFWORD_MASK (0x2000)
    #define HAL_LL_DMA_MSIZE_WORD_MASK (0x4000)
    #define HAL_LL_DMA_MINC_MASK (0x400)
    #define HAL_LL_DMA_PINC_MASK (0x200)
    #define HAL_LL_DMA_DIRECTION_MEMORY_TO_MEMORY_MASK (0x80)
    #define HAL_LL_DMA_DIRECTION_MEMORY_TO_PERIPH_MASK (0x40)
    #define HAL_LL_DMA_DIRECTION_PERIPH_TO_MEMORY_MASK (0x00)
    #define HAL_LL_DMA_CCR_PSIZE_MASK (0x1800)
    #define HAL_LL_DMA_CCR_MSIZE_MASK (0x6000)
    #define HAL_LL_DMA_CCR_PRIO_MASK (0x30000)
    #define HAL_LL_DMA_CCR_EN_BIT (0)
    #define HAL_LL_DMA_CCR_DMEIE_BIT (1)
    #define HAL_LL_DMA_CCR_TEIE_BIT (2)
    #define HAL_LL_DMA_CCR_HTIE_BIT (3)
    #define HAL_LL_DMA_CCR_TCIE_BIT (4)
    #define HAL_LL_DMA_CCR_PFCTRL_BIT (5)
    #define HAL_LL_DMA_CCR_DIR_BIT (6)
    #define HAL_LL_DMA_CCR_CIRC_BIT (8)
    #define HAL_LL_DMA_CCR_PINC_BIT (9)
    #define HAL_LL_DMA_CCR_MINC_BIT (10)
    #define HAL_LL_DMA_CCR_M2M_BIT (7)
#else
    #define HAL_LL_DMA_CCR_PRIORITY_VERY_HIGH_MASK (0x3000)
    #define HAL_LL_DMA_CCR_PRIORITY_HIGH_MASK (0x2000)
    #define HAL_LL_DMA_CCR_PRIORITY_MEDIUM_MASK (0x1000)
    #define HAL_LL_DMA_CCR_PRIORITY_LOW_MASK (0x0000)
    #define HAL_LL_DMA_CCR_CIRC_MASK (0x0020)
    #define HAL_LL_DMA_CCR_PSIZE_BYTE_MASK (0x0000)
    #define HAL_LL_DMA_CCR_PSIZE_HALFWORD_MASK (0x0100)
    #define HAL_LL_DMA_CCR_PSIZE_WORD_MASK (0x0200)
    #define HAL_LL_DMA_MSIZE_BYTE_MASK (0x0000)
    #define HAL_LL_DMA_MSIZE_HALFWORD_MASK (0x0400)
    #define HAL_LL_DMA_MSIZE_WORD_MASK (0x0800)
    #define HAL_LL_DMA_MINC_MASK (0x0080)
    #define HAL_LL_DMA_PINC_MASK (0x0040)
    #define HAL_LL_DMA_DIRECTION_MEMORY_TO_MEMORY_MASK (0x4000)
    #define HAL_LL_DMA_DIRECTION_MEMORY_TO_PERIPH_MASK (0x0010)
    #define HAL_LL_DMA_DIRECTION_PERIPH_TO_MEMORY_MASK (0x0000)
    #define HAL_LL_DMA_CCR_PSIZE_MASK (0x0300)
    #define HAL_LL_DMA_CCR_MSIZE_MASK (0x0C00)
    #define HAL_LL_DMA_CCR_PRIO_MASK (0x3000)
    #define HAL_LL_DMA_CCR_EN_BIT (0)
    #define HAL_LL_DMA_CCR_TCIE_BIT (1)
    #define HAL_LL_DMA_CCR_HTIE_BIT (2)
    #define HAL_LL_DMA_CCR_TEIE_BIT (3)
    #define HAL_LL_DMA_CCR_DIR_BIT (4)
    #define HAL_LL_DMA_CCR_CIRC_BIT (5)
    #define HAL_LL_DMA_CCR_PINC_BIT (6)
    #define HAL_LL_DMA_CCR_MINC_BIT (7)
    #define HAL_LL_DMA_CCR_M2M_BIT (14)
#endif

#ifdef MODULE_SUPPORTED
    #if defined (STM32L1xx)
        #define DMA1_BASE (0x40026000UL)
        #define DMA2_BASE (0x40026400UL)
        #define CCR_BASE_OFFSET (0x08U)
        #define STREAM_BASE_OFFSET (0x14U)
        #define IFCR_BASE_OFFSET (0x04U)
        #define HAL_LL_DMA1_CLOCK_BIT (24)
        #define HAL_LL_DMA1_CLOCK_BASE ((uint32_t)_RCC_AHBENR)
        #define HAL_LL_DMA1_STREAM_BASE (DMA1_BASE + CCR_BASE_OFFSET)
        #define HAL_LL_DMA2_CLOCK_BIT (25)
        #define HAL_LL_DMA2_CLOCK_BASE ((uint32_t)_RCC_AHBENR)
        #define HAL_LL_DMA2_STREAM_BASE (DMA2_BASE + CCR_BASE_OFFSET)
        #define HAL_LL_PWRCLK_BASE (_RCC_APB1ENR)
        #define HAL_LL_PWRCLK_BIT (28)
    #elif defined(STM32L4xx)
        #define DMA1_BASE (0x40020000UL)
        #define DMA2_BASE (0x40020400UL)
        #define DMAMUX1_BASE (0x40020800UL)
        #define CCR_BASE_OFFSET (0x08U)
        #define STREAM_BASE_OFFSET (0x14U)
        #define IFCR_BASE_OFFSET (0x04U)
        #define DMAMUX1_OFFSET (0x04U)
        #define HAL_LL_DMA1_CLOCK_BIT (0)
        #define HAL_LL_DMA1_CLOCK_BASE ((uint32_t) _RCC_AHB1ENR)
        #define HAL_LL_DMA1_STREAM_BASE (DMA1_BASE + CCR_BASE_OFFSET)
        #define HAL_LL_DMA2_CLOCK_BIT (1)
        #define HAL_LL_DMAMUX1_CLOCK_BIT (2)
        #define HAL_LL_DMA2_CLOCK_BASE ((uint32_t)_RCC_AHB1ENR)
        #define HAL_LL_DMA2_STREAM_BASE (DMA2_BASE + CCR_BASE_OFFSET)
        #define HAL_LL_PWRCLK_BASE (_RCC_APB1ENR1)
        #define HAL_LL_PWRCLK_BIT (28)
    #elif defined(STM32H7xx)
        #define DMA1_BASE (0x40020000UL)
        #define DMA2_BASE (0x40020400UL)
        #define DMAMUX1_BASE (0x40020800UL)
        #define CCR_BASE_OFFSET (0x10U)
        #define STREAM_BASE_OFFSET (0x18U)
        #define IFCR_BASE_OFFSET (0x04U)
        #define DMAMUX1_OFFSET (0x04U)
        #define HAL_LL_DMA1_CLOCK_BIT (0)
        #define HAL_LL_DMA1_CLOCK_BASE ((uint32_t) _RCC_AHB1ENR)
        #define HAL_LL_DMA1_STREAM_BASE (DMA1_BASE + CCR_BASE_OFFSET)
        #define HAL_LL_DMA2_CLOCK_BIT (1)
        #define HAL_LL_DMAMUX1_CLOCK_BIT (2)
        #define HAL_LL_DMA2_CLOCK_BASE ((uint32_t)_RCC_AHB1ENR)
        #define HAL_LL_DMA2_STREAM_BASE (DMA2_BASE + CCR_BASE_OFFSET)
        #define HAL_LL_PWRCLK_BIT (0)
    #elif defined(STM32G0xx)
        #define DMA1_BASE (0x40020000UL)
        #define DMA2_BASE (0x40020400UL)
        #define DMAMUX1_BASE (0x40020800UL)
        #define CCR_BASE_OFFSET (0x08U)
        #define STREAM_BASE_OFFSET (0x14U)
        #define IFCR_BASE_OFFSET (0x04U)
        #define DMAMUX1_OFFSET (0x04U)
        #define HAL_LL_DMA1_CLOCK_BIT (0)
        #define HAL_LL_DMA1_CLOCK_BASE ((uint32_t) _RCC_AHBENR)
        #define HAL_LL_DMA1_STREAM_BASE (DMA1_BASE + CCR_BASE_OFFSET)
        #define HAL_LL_DMA2_CLOCK_BIT (1)
        #define HAL_LL_DMAMUX1_CLOCK_BIT (2)
        #define HAL_LL_DMA2_CLOCK_BASE ((uint32_t)_RCC_AHBENR)
        #define HAL_LL_DMA2_STREAM_BASE (DMA2_BASE + CCR_BASE_OFFSET)
        #define HAL_LL_PWRCLK_BASE (_RCC_APB1ENR)
        #define HAL_LL_PWRCLK_BIT (28)
    #else
        #define DMA1_BASE (0x40020000UL)
        #define DMA2_BASE (0x40020400UL)
        #define DMA_CSELR_OFFSET (0x0A8U)
        #define DMA_CSELR_CHANNEL_OFFSET (0x04U)
        #define CCR_BASE_OFFSET (0x08U)
        #define STREAM_BASE_OFFSET (0x14U)
        #define IFCR_BASE_OFFSET (0x04U)
        #define HAL_LL_DMA1_CLOCK_BIT (0)
        #define HAL_LL_DMA1_CLOCK_BASE ((uint32_t)_RCC_AHBENR)
        #define HAL_LL_DMA1_STREAM_BASE (DMA1_BASE + CCR_BASE_OFFSET)
        #define HAL_LL_DMA2_CLOCK_BIT (1)
        #define HAL_LL_DMA2_CLOCK_BASE ((uint32_t)_RCC_AHBENR)
        #define HAL_LL_DMA2_STREAM_BASE (DMA2_BASE + CCR_BASE_OFFSET)
        #define HAL_LL_PWRCLK_BASE (_RCC_APB1ENR)
        #define HAL_LL_PWRCLK_BIT (28)
    #endif
#endif

